---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir.Direction
source: html/ce27fbed-ec51-1fd1-5b32-8646cfce30c4.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir.Direction Property

The direction of the RebarShapeSegment in UV-space.

## Syntax (C#)
```csharp
public UV Direction { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null